---
kind: method
id: M:Autodesk.Revit.DB.ExternalGeometryId.op_Equality(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.ExternalGeometryId)
source: html/2463f74a-058f-a694-f78b-930e7f0ac431.htm
---
# Autodesk.Revit.DB.ExternalGeometryId.op_Equality Method

Determines whether two ExternalGeometryIds are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	ExternalGeometryId first,
	ExternalGeometryId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ExternalGeometryId`) - The first ExternalGeometryId.
- **second** (`Autodesk.Revit.DB.ExternalGeometryId`) - The second ExternalGeometryId.

## Returns
True if the ExternalGeometryIds are the same; otherwise, false.